text = "蕤芑杞剆𮬒𮫸𮢆𮡀𮐠𮌥𮊦𮆞𮅠𭺷𭶙𭲻𭪂𭨉𭜅𭓞𭒨𭏜𭈮𭇴𭇒𬽺𬽺𬳧𬱃𬰚𬯋𬮼𬮍𬫃𬤹𬠸𬟓𬞆𬗋𬔻𬓥𬒰𬒔𬒀𬐨𬏺𬎆𬍳𬍰𬍂𬌲𬌗𬋋𬊧𬊕𬊏𬉷𬈹𬇣𬇞𬄾𬁝𬁆𬀲𫾻𫺢𫵷𫲦𫲐𫲄𫰾𫰋𫯜𫩠𫨨𫦪𫤪𫣲𫜹𫒇𫏜𫌴𫈣𫂐𫁢𫀗𪽇𪼓𪻵𪻳𪸛𪷫𪵥𪬬𪦴𪦪𪣏𪝼𪜱𪛟𪛞𪁏𨯌𨩌𧝁𧝁𧃰𧃰𦭳𦒉𦒉𦐹𦐹𦐐𦐐𦏹𦏹𥢗𥖄𥖄𥓂𥐣𤫎𤤂𤌧𣟂𣟂𣒍𣏖𢸋𢊈𡵞𡵞𡩴𡩴𡨤𡣝𡞵𡞵𡛩𡍼𡊐𡄤𠿮𠲘𠲘𠱑𠜎𠜎𠕆鿿鿾鿽黙黙鳯鱇鬰髥髥髙驣驣馀餸餸飬飬飬顔頋韈韈靭靭靜靜静静雫隶隶隠闗閲鐡鏆鏆鍮鍮録錅鋭銹銹銭醖酶酶鄥郷郞邨邨邉逺逹輼踭踭貮譧譧譛説詝訨覚覌衆衆衆蜕藴藛薫蕐蔴蔴蒳蒨蒨葻菁菁莟荘茺茺艈腽脱聨翺翺翺翱翱翬翬翙翖翆羙缐繎緼緖綫綫継綉綉絶簘箶筑筑笖竸窰窰穏穂稥税礰礏硏硏真真眀皟畵瓇珁玙玍狓犾爲爕爕熻熻熮熮煴煕灎瀞瀞満淸淎淎涚沗汧汧氲樋樋楽植植棁栿査枼枊曽曺曟暁晆旾敚掦捝拐拐扅戦愠惪悦徳彦彠录录廸廸帯巌岭岭岍岍岄岃屛尭尙寭寜孉嫏嫏媪姸姸奬夀壦増圑圅嚤嚤嘨啫啫啟啟啚啚啗啗呉吿变变叄厡卋勲劒劎剣凑凑冄兿兑偼倩倩俢俆佀亜亖乸乸丗䨩䨩䤾䤾䢒䘕䘕䔵䎗䎗䁘䁘㹯㵲㠦㜏㛇㛇㛇"

# str 中的每个元素都是一个字符，将其转换为一个整数
dec = [ord(c) for c in text]

# 压缩
dec = list(set(dec))
# 排序
dec.sort()

print(dec)
# 存为txt文件
with open('dec.txt', 'w') as f:
    for i in dec:
        f.write(str(i) + '\n')